package net.shopxx.dao;

import net.shopxx.entity.Specification;

/**
 * Dao接口 - 商品规格
 * ============================================================================
 * 版权所有 2008-2010 长沙鼎诚软件有限公司,并保留所有权利。
 * ----------------------------------------------------------------------------
 * 提示：在未取得SHOP++商业授权之前,您不能将本软件应用于商业用途,否则SHOP++将保留追究的权力。
 * ----------------------------------------------------------------------------
 * 官方网站：http://www.shopxx.net
 * ----------------------------------------------------------------------------
 * KEY: SHOPXXC0C633DBE1BACF5A05979923F6AD164F
 * ============================================================================
 */

public interface SpecificationDao extends BaseDao<Specification, String> {
	
}